zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32c5-pinctrl.h
/**
 * @name MCPWM0_OUT0A
 * @{
 */
#define MCPWM0_OUT0A_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_PWM0_OUT0A)
#define MCPWM0_OUT0A_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_PWM0_OUT0A)
/** @} */

/**
 * @name MCPWM0_OUT0B
 * @{
 */
#define MCPWM0_OUT0B_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_PWM0_OUT0B)
#define MCPWM0_OUT0B_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_PWM0_OUT0B)
/** @} */

/**
 * @name MCPWM0_OUT1A
 * @{
 */
#define MCPWM0_OUT1A_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_PWM0_OUT1A)
#define MCPWM0_OUT1A_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_PWM0_OUT1A)
/** @} */

/**
 * @name MCPWM0_OUT1B
 * @{
 */
#define MCPWM0_OUT1B_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_PWM0_OUT1B)
#define MCPWM0_OUT1B_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_PWM0_OUT1B)
/** @} */

/**
 * @name MCPWM0_OUT2A
 * @{
 */
#define MCPWM0_OUT2A_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_PWM0_OUT2A)
#define MCPWM0_OUT2A_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_PWM0_OUT2A)
/** @} */

/**
 * @name MCPWM0_OUT2B
 * @{
 */
#define MCPWM0_OUT2B_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_PWM0_OUT2B)
#define MCPWM0_OUT2B_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_PWM0_OUT2B)
/** @} */

/**
 * @name MCPWM0_SYNC0
 * @{
 */
#define MCPWM0_SYNC0_GPIO0  ESP32_PINMUX(0, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO1  ESP32_PINMUX(1, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO2  ESP32_PINMUX(2, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO3  ESP32_PINMUX(3, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO4  ESP32_PINMUX(4, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO5  ESP32_PINMUX(5, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO6  ESP32_PINMUX(6, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO7  ESP32_PINMUX(7, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO8  ESP32_PINMUX(8, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO9  ESP32_PINMUX(9, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO10 ESP32_PINMUX(10, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO11 ESP32_PINMUX(11, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO12 ESP32_PINMUX(12, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO13 ESP32_PINMUX(13, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO14 ESP32_PINMUX(14, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO15 ESP32_PINMUX(15, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO16 ESP32_PINMUX(16, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO17 ESP32_PINMUX(17, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO18 ESP32_PINMUX(18, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO19 ESP32_PINMUX(19, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO20 ESP32_PINMUX(20, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO21 ESP32_PINMUX(21, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO22 ESP32_PINMUX(22, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO23 ESP32_PINMUX(23, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO24 ESP32_PINMUX(24, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO25 ESP32_PINMUX(25, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO26 ESP32_PINMUX(26, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO27 ESP32_PINMUX(27, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO28 ESP32_PINMUX(28, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
/** @} */

/**
 * @name MCPWM0_SYNC1
 * @{
 */
#define MCPWM0_SYNC1_GPIO0  ESP32_PINMUX(0, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO1  ESP32_PINMUX(1, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO2  ESP32_PINMUX(2, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO3  ESP32_PINMUX(3, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO4  ESP32_PINMUX(4, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO5  ESP32_PINMUX(5, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO6  ESP32_PINMUX(6, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO7  ESP32_PINMUX(7, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO8  ESP32_PINMUX(8, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO9  ESP32_PINMUX(9, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO10 ESP32_PINMUX(10, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO11 ESP32_PINMUX(11, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO12 ESP32_PINMUX(12, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO13 ESP32_PINMUX(13, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO14 ESP32_PINMUX(14, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO15 ESP32_PINMUX(15, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO16 ESP32_PINMUX(16, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO17 ESP32_PINMUX(17, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO18 ESP32_PINMUX(18, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO19 ESP32_PINMUX(19, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO20 ESP32_PINMUX(20, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO21 ESP32_PINMUX(21, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO22 ESP32_PINMUX(22, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO23 ESP32_PINMUX(23, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO24 ESP32_PINMUX(24, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO25 ESP32_PINMUX(25, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO26 ESP32_PINMUX(26, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO27 ESP32_PINMUX(27, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
#define MCPWM0_SYNC1_GPIO28 ESP32_PINMUX(28, ESP_PWM0_SYNC1_IN, ESP_NOSIG)
/** @} */

/**
 * @name MCPWM0_SYNC2
 * @{
 */
#define MCPWM0_SYNC2_GPIO0  ESP32_PINMUX(0, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO1  ESP32_PINMUX(1, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO2  ESP32_PINMUX(2, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO3  ESP32_PINMUX(3, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO4  ESP32_PINMUX(4, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO5  ESP32_PINMUX(5, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO6  ESP32_PINMUX(6, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO7  ESP32_PINMUX(7, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO8  ESP32_PINMUX(8, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO9  ESP32_PINMUX(9, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO10 ESP32_PINMUX(10, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO11 ESP32_PINMUX(11, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO12 ESP32_PINMUX(12, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO13 ESP32_PINMUX(13, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO14 ESP32_PINMUX(14, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO15 ESP32_PINMUX(15, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO16 ESP32_PINMUX(16, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO17 ESP32_PINMUX(17, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO18 ESP32_PINMUX(18, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO19 ESP32_PINMUX(19, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO20 ESP32_PINMUX(20, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO21 ESP32_PINMUX(21, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO22 ESP32_PINMUX(22, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO23 ESP32_PINMUX(23, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO24 ESP32_PINMUX(24, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO25 ESP32_PINMUX(25, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO26 ESP32_PINMUX(26, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO27 ESP32_PINMUX(27, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
#define MCPWM0_SYNC2_GPIO28 ESP32_PINMUX(28, ESP_PWM0_SYNC2_IN, ESP_NOSIG)
/** @} */

/**
 * @name PCNT0_CH0CTRL
 * @{
 */
#define PCNT0_CH0CTRL_GPIO0  ESP32_PINMUX(0, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO1  ESP32_PINMUX(1, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO2  ESP32_PINMUX(2, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO3  ESP32_PINMUX(3, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO4  ESP32_PINMUX(4, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO5  ESP32_PINMUX(5, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO6  ESP32_PINMUX(6, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO7  ESP32_PINMUX(7, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO8  ESP32_PINMUX(8, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO9  ESP32_PINMUX(9, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO22 ESP32_PINMUX(22, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO23 ESP32_PINMUX(23, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO24 ESP32_PINMUX(24, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO25 ESP32_PINMUX(25, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
#define PCNT0_CH0CTRL_GPIO28 ESP32_PINMUX(28, ESP_PCNT_CTRL_CH0_IN0, ESP_NOSIG)
/** @} */

