zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32c5-pinctrl.h
/**
 * @name PCNT2_CH1SIG
 * @{
 */
#define PCNT2_CH1SIG_GPIO0  ESP32_PINMUX(0, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO1  ESP32_PINMUX(1, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO2  ESP32_PINMUX(2, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO3  ESP32_PINMUX(3, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO4  ESP32_PINMUX(4, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO5  ESP32_PINMUX(5, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO6  ESP32_PINMUX(6, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO7  ESP32_PINMUX(7, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO8  ESP32_PINMUX(8, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO9  ESP32_PINMUX(9, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO24 ESP32_PINMUX(24, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
#define PCNT2_CH1SIG_GPIO28 ESP32_PINMUX(28, ESP_PCNT_SIG_CH1_IN2, ESP_NOSIG)
/** @} */

/**
 * @name PCNT3_CH0CTRL
 * @{
 */
#define PCNT3_CH0CTRL_GPIO0  ESP32_PINMUX(0, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO1  ESP32_PINMUX(1, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO2  ESP32_PINMUX(2, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO3  ESP32_PINMUX(3, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO4  ESP32_PINMUX(4, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO5  ESP32_PINMUX(5, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO6  ESP32_PINMUX(6, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO7  ESP32_PINMUX(7, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO8  ESP32_PINMUX(8, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO9  ESP32_PINMUX(9, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO22 ESP32_PINMUX(22, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO23 ESP32_PINMUX(23, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO24 ESP32_PINMUX(24, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO25 ESP32_PINMUX(25, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0CTRL_GPIO28 ESP32_PINMUX(28, ESP_PCNT_CTRL_CH0_IN3, ESP_NOSIG)
/** @} */

/**
 * @name PCNT3_CH0SIG
 * @{
 */
#define PCNT3_CH0SIG_GPIO0  ESP32_PINMUX(0, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO1  ESP32_PINMUX(1, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO2  ESP32_PINMUX(2, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO3  ESP32_PINMUX(3, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO4  ESP32_PINMUX(4, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO5  ESP32_PINMUX(5, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO6  ESP32_PINMUX(6, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO7  ESP32_PINMUX(7, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO8  ESP32_PINMUX(8, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO9  ESP32_PINMUX(9, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO24 ESP32_PINMUX(24, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO28 ESP32_PINMUX(28, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
/** @} */

/**
 * @name PCNT3_CH1CTRL
 * @{
 */
#define PCNT3_CH1CTRL_GPIO0  ESP32_PINMUX(0, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO1  ESP32_PINMUX(1, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO2  ESP32_PINMUX(2, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO3  ESP32_PINMUX(3, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO4  ESP32_PINMUX(4, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO5  ESP32_PINMUX(5, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO6  ESP32_PINMUX(6, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO7  ESP32_PINMUX(7, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO8  ESP32_PINMUX(8, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO9  ESP32_PINMUX(9, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO22 ESP32_PINMUX(22, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO23 ESP32_PINMUX(23, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO24 ESP32_PINMUX(24, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO25 ESP32_PINMUX(25, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO28 ESP32_PINMUX(28, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
/** @} */

/**
 * @name PCNT3_CH1SIG
 * @{
 */
#define PCNT3_CH1SIG_GPIO0  ESP32_PINMUX(0, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO1  ESP32_PINMUX(1, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO2  ESP32_PINMUX(2, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO3  ESP32_PINMUX(3, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO4  ESP32_PINMUX(4, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO5  ESP32_PINMUX(5, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO6  ESP32_PINMUX(6, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO7  ESP32_PINMUX(7, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO8  ESP32_PINMUX(8, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO9  ESP32_PINMUX(9, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO24 ESP32_PINMUX(24, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO28 ESP32_PINMUX(28, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
/** @} */

/**
 * @name RMT_IN0
 * @{
 */
#define RMT_IN0_GPIO0  ESP32_PINMUX(0, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO1  ESP32_PINMUX(1, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO2  ESP32_PINMUX(2, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO3  ESP32_PINMUX(3, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO4  ESP32_PINMUX(4, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO5  ESP32_PINMUX(5, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO6  ESP32_PINMUX(6, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO7  ESP32_PINMUX(7, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO8  ESP32_PINMUX(8, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO9  ESP32_PINMUX(9, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO22 ESP32_PINMUX(22, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO23 ESP32_PINMUX(23, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO24 ESP32_PINMUX(24, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO25 ESP32_PINMUX(25, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO26 ESP32_PINMUX(26, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO27 ESP32_PINMUX(27, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO28 ESP32_PINMUX(28, ESP_RMT_SIG_IN0, ESP_NOSIG)
/** @} */

/**
 * @name RMT_IN1
 * @{
 */
#define RMT_IN1_GPIO0  ESP32_PINMUX(0, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO1  ESP32_PINMUX(1, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO2  ESP32_PINMUX(2, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO3  ESP32_PINMUX(3, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO4  ESP32_PINMUX(4, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO5  ESP32_PINMUX(5, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO6  ESP32_PINMUX(6, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO7  ESP32_PINMUX(7, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO8  ESP32_PINMUX(8, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO9  ESP32_PINMUX(9, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO22 ESP32_PINMUX(22, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO23 ESP32_PINMUX(23, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO24 ESP32_PINMUX(24, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO25 ESP32_PINMUX(25, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO26 ESP32_PINMUX(26, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO27 ESP32_PINMUX(27, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO28 ESP32_PINMUX(28, ESP_RMT_SIG_IN1, ESP_NOSIG)
/** @} */

/**
 * @name RMT_OUT0
 * @{
 */
#define RMT_OUT0_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_RMT_SIG_OUT0)
/** @} */

/**
 * @name RMT_OUT1
 * @{
 */
#define RMT_OUT1_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_RMT_SIG_OUT1)
/** @} */

/**
 * @name SPIM2_CSEL
 * @{
 */
#define SPIM2_CSEL_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS0_OUT)
/** @} */

/**
 * @name SPIM2_CSEL1
 * @{
 */
#define SPIM2_CSEL1_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS1_OUT)
/** @} */

