zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32c5-pinctrl.h
/**
 * @name SPIM2_CSEL2
 * @{
 */
#define SPIM2_CSEL2_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS2_OUT)
/** @} */

/**
 * @name SPIM2_CSEL3
 * @{
 */
#define SPIM2_CSEL3_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS3_OUT)
/** @} */

/**
 * @name SPIM2_CSEL4
 * @{
 */
#define SPIM2_CSEL4_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS4_OUT)
/** @} */

/**
 * @name SPIM2_CSEL5
 * @{
 */
#define SPIM2_CSEL5_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS5_OUT)
/** @} */

/**
 * @name SPIM2_MISO
 * @{
 */
#define SPIM2_MISO_GPIO0  ESP32_PINMUX(0, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO1  ESP32_PINMUX(1, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO2  ESP32_PINMUX(2, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO3  ESP32_PINMUX(3, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO4  ESP32_PINMUX(4, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO5  ESP32_PINMUX(5, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO6  ESP32_PINMUX(6, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO7  ESP32_PINMUX(7, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO8  ESP32_PINMUX(8, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO9  ESP32_PINMUX(9, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO10 ESP32_PINMUX(10, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO11 ESP32_PINMUX(11, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO12 ESP32_PINMUX(12, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO13 ESP32_PINMUX(13, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO14 ESP32_PINMUX(14, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO15 ESP32_PINMUX(15, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO16 ESP32_PINMUX(16, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO17 ESP32_PINMUX(17, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO18 ESP32_PINMUX(18, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO19 ESP32_PINMUX(19, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO20 ESP32_PINMUX(20, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO21 ESP32_PINMUX(21, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO22 ESP32_PINMUX(22, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO23 ESP32_PINMUX(23, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO24 ESP32_PINMUX(24, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO25 ESP32_PINMUX(25, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO26 ESP32_PINMUX(26, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO27 ESP32_PINMUX(27, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO28 ESP32_PINMUX(28, ESP_FSPIQ_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIM2_MOSI
 * @{
 */
#define SPIM2_MOSI_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPID_OUT)
/** @} */

/**
 * @name SPIM2_SCLK
 * @{
 */
#define SPIM2_SCLK_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICLK_OUT)
/** @} */

/**
 * @name TWAI0_BUS_OFF
 * @{
 */
#define TWAI0_BUS_OFF_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
#define TWAI0_BUS_OFF_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_TWAI0_BUS_OFF_ON)
/** @} */

/**
 * @name TWAI0_CLKOUT
 * @{
 */
#define TWAI0_CLKOUT_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_TWAI0_CLKOUT)
#define TWAI0_CLKOUT_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_TWAI0_CLKOUT)
/** @} */

/**
 * @name TWAI0_RX
 * @{
 */
#define TWAI0_RX_GPIO0  ESP32_PINMUX(0, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO1  ESP32_PINMUX(1, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO2  ESP32_PINMUX(2, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO3  ESP32_PINMUX(3, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO4  ESP32_PINMUX(4, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO5  ESP32_PINMUX(5, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO6  ESP32_PINMUX(6, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO7  ESP32_PINMUX(7, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO8  ESP32_PINMUX(8, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO9  ESP32_PINMUX(9, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO10 ESP32_PINMUX(10, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO11 ESP32_PINMUX(11, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO12 ESP32_PINMUX(12, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO13 ESP32_PINMUX(13, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO14 ESP32_PINMUX(14, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO15 ESP32_PINMUX(15, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO16 ESP32_PINMUX(16, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO17 ESP32_PINMUX(17, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO18 ESP32_PINMUX(18, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO19 ESP32_PINMUX(19, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO20 ESP32_PINMUX(20, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO21 ESP32_PINMUX(21, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO22 ESP32_PINMUX(22, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO23 ESP32_PINMUX(23, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO24 ESP32_PINMUX(24, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO25 ESP32_PINMUX(25, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO26 ESP32_PINMUX(26, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO27 ESP32_PINMUX(27, ESP_TWAI0_RX, ESP_NOSIG)
#define TWAI0_RX_GPIO28 ESP32_PINMUX(28, ESP_TWAI0_RX, ESP_NOSIG)
/** @} */

/**
 * @name TWAI0_TX
 * @{
 */
#define TWAI0_TX_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_TWAI0_TX)
#define TWAI0_TX_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_TWAI0_TX)
/** @} */

