zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32c5-pinctrl.h
/**
 * @name TWAI1_BUS_OFF
 * @{
 */
#define TWAI1_BUS_OFF_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
#define TWAI1_BUS_OFF_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_TWAI1_BUS_OFF_ON)
/** @} */

/**
 * @name TWAI1_CLKOUT
 * @{
 */
#define TWAI1_CLKOUT_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_TWAI1_CLKOUT)
#define TWAI1_CLKOUT_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_TWAI1_CLKOUT)
/** @} */

/**
 * @name TWAI1_RX
 * @{
 */
#define TWAI1_RX_GPIO0  ESP32_PINMUX(0, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO1  ESP32_PINMUX(1, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO2  ESP32_PINMUX(2, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO3  ESP32_PINMUX(3, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO4  ESP32_PINMUX(4, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO5  ESP32_PINMUX(5, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO6  ESP32_PINMUX(6, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO7  ESP32_PINMUX(7, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO8  ESP32_PINMUX(8, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO9  ESP32_PINMUX(9, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO10 ESP32_PINMUX(10, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO11 ESP32_PINMUX(11, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO12 ESP32_PINMUX(12, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO13 ESP32_PINMUX(13, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO14 ESP32_PINMUX(14, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO15 ESP32_PINMUX(15, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO16 ESP32_PINMUX(16, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO17 ESP32_PINMUX(17, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO18 ESP32_PINMUX(18, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO19 ESP32_PINMUX(19, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO20 ESP32_PINMUX(20, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO21 ESP32_PINMUX(21, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO22 ESP32_PINMUX(22, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO23 ESP32_PINMUX(23, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO24 ESP32_PINMUX(24, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO25 ESP32_PINMUX(25, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO26 ESP32_PINMUX(26, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO27 ESP32_PINMUX(27, ESP_TWAI1_RX, ESP_NOSIG)
#define TWAI1_RX_GPIO28 ESP32_PINMUX(28, ESP_TWAI1_RX, ESP_NOSIG)
/** @} */

/**
 * @name TWAI1_TX
 * @{
 */
#define TWAI1_TX_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_TWAI1_TX)
#define TWAI1_TX_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_TWAI1_TX)
/** @} */

/**
 * @name UART0_CTS
 * @{
 */
#define UART0_CTS_GPIO0  ESP32_PINMUX(0, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO1  ESP32_PINMUX(1, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO2  ESP32_PINMUX(2, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO3  ESP32_PINMUX(3, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO4  ESP32_PINMUX(4, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO5  ESP32_PINMUX(5, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO6  ESP32_PINMUX(6, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO7  ESP32_PINMUX(7, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO8  ESP32_PINMUX(8, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO9  ESP32_PINMUX(9, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO10 ESP32_PINMUX(10, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO11 ESP32_PINMUX(11, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO12 ESP32_PINMUX(12, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO13 ESP32_PINMUX(13, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO14 ESP32_PINMUX(14, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO15 ESP32_PINMUX(15, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO16 ESP32_PINMUX(16, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO17 ESP32_PINMUX(17, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO18 ESP32_PINMUX(18, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO19 ESP32_PINMUX(19, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO20 ESP32_PINMUX(20, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO21 ESP32_PINMUX(21, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO22 ESP32_PINMUX(22, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO23 ESP32_PINMUX(23, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO24 ESP32_PINMUX(24, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO25 ESP32_PINMUX(25, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO26 ESP32_PINMUX(26, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO27 ESP32_PINMUX(27, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO28 ESP32_PINMUX(28, ESP_U0CTS_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART0_DSR
 * @{
 */
#define UART0_DSR_GPIO0  ESP32_PINMUX(0, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO1  ESP32_PINMUX(1, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO2  ESP32_PINMUX(2, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO3  ESP32_PINMUX(3, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO4  ESP32_PINMUX(4, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO5  ESP32_PINMUX(5, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO6  ESP32_PINMUX(6, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO7  ESP32_PINMUX(7, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO8  ESP32_PINMUX(8, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO9  ESP32_PINMUX(9, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO10 ESP32_PINMUX(10, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO11 ESP32_PINMUX(11, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO12 ESP32_PINMUX(12, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO13 ESP32_PINMUX(13, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO14 ESP32_PINMUX(14, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO15 ESP32_PINMUX(15, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO16 ESP32_PINMUX(16, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO17 ESP32_PINMUX(17, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO18 ESP32_PINMUX(18, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO19 ESP32_PINMUX(19, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO20 ESP32_PINMUX(20, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO21 ESP32_PINMUX(21, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO22 ESP32_PINMUX(22, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO23 ESP32_PINMUX(23, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO24 ESP32_PINMUX(24, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO25 ESP32_PINMUX(25, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO26 ESP32_PINMUX(26, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO27 ESP32_PINMUX(27, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO28 ESP32_PINMUX(28, ESP_U0DSR_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART0_DTR
 * @{
 */
#define UART0_DTR_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U0DTR_OUT)
/** @} */

/**
 * @name UART0_RTS
 * @{
 */
#define UART0_RTS_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U0RTS_OUT)
/** @} */

/**
 * @name UART0_RX
 * @{
 */
#define UART0_RX_GPIO0  ESP32_PINMUX(0, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO1  ESP32_PINMUX(1, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO2  ESP32_PINMUX(2, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO3  ESP32_PINMUX(3, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO4  ESP32_PINMUX(4, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO5  ESP32_PINMUX(5, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO6  ESP32_PINMUX(6, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO7  ESP32_PINMUX(7, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO8  ESP32_PINMUX(8, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO9  ESP32_PINMUX(9, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO10 ESP32_PINMUX(10, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO11 ESP32_PINMUX(11, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO12 ESP32_PINMUX(12, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO13 ESP32_PINMUX(13, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO14 ESP32_PINMUX(14, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO15 ESP32_PINMUX(15, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO16 ESP32_PINMUX(16, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO17 ESP32_PINMUX(17, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO18 ESP32_PINMUX(18, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO19 ESP32_PINMUX(19, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO20 ESP32_PINMUX(20, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO21 ESP32_PINMUX(21, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO22 ESP32_PINMUX(22, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO23 ESP32_PINMUX(23, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO24 ESP32_PINMUX(24, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO25 ESP32_PINMUX(25, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO26 ESP32_PINMUX(26, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO27 ESP32_PINMUX(27, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO28 ESP32_PINMUX(28, ESP_U0RXD_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART0_TX
 * @{
 */
#define UART0_TX_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U0TXD_OUT)
/** @} */

/**
 * @name UART1_CTS
 * @{
 */
#define UART1_CTS_GPIO0  ESP32_PINMUX(0, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO1  ESP32_PINMUX(1, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO2  ESP32_PINMUX(2, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO3  ESP32_PINMUX(3, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO4  ESP32_PINMUX(4, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO5  ESP32_PINMUX(5, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO6  ESP32_PINMUX(6, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO7  ESP32_PINMUX(7, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO8  ESP32_PINMUX(8, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO9  ESP32_PINMUX(9, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO10 ESP32_PINMUX(10, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO11 ESP32_PINMUX(11, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO12 ESP32_PINMUX(12, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO13 ESP32_PINMUX(13, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO14 ESP32_PINMUX(14, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO15 ESP32_PINMUX(15, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO16 ESP32_PINMUX(16, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO17 ESP32_PINMUX(17, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO18 ESP32_PINMUX(18, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO19 ESP32_PINMUX(19, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO20 ESP32_PINMUX(20, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO21 ESP32_PINMUX(21, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO22 ESP32_PINMUX(22, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO23 ESP32_PINMUX(23, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO24 ESP32_PINMUX(24, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO25 ESP32_PINMUX(25, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO26 ESP32_PINMUX(26, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO27 ESP32_PINMUX(27, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO28 ESP32_PINMUX(28, ESP_U1CTS_IN, ESP_NOSIG)
/** @} */

